{
  "context_types": {
    "Contract": "A contract is a legally binding agreement between two or more parties that creates mutual obligations enforceable by law. Contracts typically include terms and conditions, rights and responsibilities, and may cover topics such as services, sales, employment, confidentiality, or intellectual property. They often contain clauses regarding payment, duration, termination, dispute resolution, and remedies for breach. Examples include NDAs, service agreements, purchase agreements, and employment contracts.",
    "Litigation": "Litigation documents are related to the process of resolving disputes through the court system. This includes pleadings, motions, court orders, judgments, discovery materials, depositions, and transcripts. These documents may originate from civil, criminal, or administrative proceedings and often involve parties contesting legal rights, liabilities, or damages before a judge or jury.",
    "Regulatory": "Regulatory documents pertain to compliance with rules, laws, and guidelines established by governmental or regulatory agencies. These may include filings, licenses, permits, agency opinions, compliance reports, and correspondence with regulators. They are often required for operating within certain industries (e.g., finance, healthcare, environment) and ensure adherence to statutory and administrative requirements.",
    "Financial": "Financial documents record, summarize, or analyze monetary transactions, assets, liabilities, or fiscal positions relevant to legal or business matters. Examples include balance sheets, income statements, annual reports, prospectuses, and financial disclosures. These documents are often used in audits, due diligence, regulatory filings, and litigation involving financial issues.",
    "Statutory": "Statutory documents are legal texts that establish, interpret, or codify laws and regulations enacted by legislative bodies. This category includes statutes, codes, ordinances, and regulations, as well as official interpretations or amendments. Statutory documents provide the legal framework for rights, obligations, and procedures in various areas of law.",
    "Email": "Emails are electronic communications that may contain legal discussions, negotiations, agreements, notifications, or evidence relevant to legal matters. They can serve as records of intent, consent, or notice, and may be used in litigation, contract formation, or regulatory compliance.",
    "other": "Documents that do not clearly fit into the above categories. This may include miscellaneous legal, business, or administrative records, such as informal internal or external written notes (memos), board minutes, company policies, certificates, or any document whose primary context is not covered by the defined types."
  },
  "subcategories": {
    "Contract": [
      "Assignment Agreement",
      "Collaboration Agreement",
      "Collective Bargaining Agreement",
      "Commercial Contract",
      "Contract",
      "Contribution Agreement",
      "Credit Agreement",
      "Data Processing Addendum",
      "Deed",
      "Disclosure Schedule",
      "Employee Benefits Agreement",
      "Guaranty",
      "Indenture",
      "Insurance Policy",
      "Investment Agreement",
      "Investor Rights Agreement",
      "Joinder",
      "Joint Venture Agreement",
      "Lease",
      "Letter Agreement",
      "Letter of Transmittal",
      "License Agreement",
      "Limited Partnership Agreement",
      "Loan Agreement",
      "Lockup Agreement",
      "Merger Agreement",
      "Mortgage Agreement",
      "Non-Disclosure Agreement",
      "Operating Agreement",
      "Order form",
      "Partnership Agreement",
      "Plan of Reorganization",
      "Purchase Agreement",
      "Registration Rights Agreement",
      "Security Agreement",
      "Severance Agreement",
      "Shareholder Rights Agreement",
      "Side Letter",
      "Stock Options Grant",
      "Stock Purchase Agreement",
      "Terms of Service",
      "Transition Service Agreement",
      "Voting Agreement"
    ],
    "Litigation": [
      "Answer",
      "Brief",
      "Business Schedule",
      "Complaint",
      "Court Decision",
      "Discovery",
      "Deposition",
      "Expert Report",
      "Internal Memo",
      "Motion",
      "Interrogatories",
      "Other Court Filings",
      "Transcript"
    ],
    "Regulatory": [
      "Agent Complaint",
      "Agent Comprehensive",
      "Agency Opinion",
      "Regulatory Filing",
      "Regulatory Law",
      "Patent",
      "Patent Application",
      "Trademark Application",                                                        
      "Trademark Registration"
    ],
    "Financial": [
      "Annual Report",
      "Balance Sheet",
      "Financial Statement"
    ],
    "Statutory": [
      "Statutory Law",
      "Insurance Law",
      "Securities Law"
    ],
    "Email": [
      "Email Thread"
    ],
    "other": [
      "Advisory Opinion",
      "Articles of Incorporation",
      "Articles of Organization",
      "Board Minutes",
      "Bond",
      "Bylaws",
      "Certificate of Designation",
      "Company Policy",
      "Employee Stock Purchase Plan",
      "Insurance Certificate",
      "Invoice",
      "License",
      "Memorandum", 
      "Other"
    ]
  }
}